app/controllers/transactions_controller.rb

  def create
    @transaction = Transaction.new(transaction_params)
    @account_id = current_user.account_id

    respond_to do |format|
      if @transaction.save
---
INSERT INTO "transactions" ("account_id", "sum", "created_at", "updated_at", "kind", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["account_id", 7], ["sum", "20.0"], ["created_at", "2018-08-14 16:50:31.671509"], ["updated_at", "2018-08-14 16:50:31.671509"], ["kind", "deposit"], ["user_id", 4]]